openfoam9/tutorials/multiphase/multiphaseEulerFoam/RAS/bubblePipe/Allrun
#!/bin/sh

# Run from this directory
cd "${0%/*}" || exit 1

# Source run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# Run case
runApplication blockMesh
runApplication topoSet
runApplication decomposePar
runParallel    $(getApplication)
runApplication reconstructPar

( cd validation && ./createGraphs )

#------------------------------------------------------------------------------
